# Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница.
# Петя помогает Кате по математике. Он задумывает два натуральных числа X и Y (X,Y≤1000),
# а Катя должна их отгадать. Для этого Петя делает две подсказки.
# Он называет сумму этих чисел S и их произведение P.
# Помогите Кате отгадать задуманные Петей числа.
# Пример:
# 4 4 -> 2 2
# 5 6 -> 2 *

sum = int(input('Загадайте два числа и введите их сумму: '))
composition = int(input('Введите произведение этих чисел: '))
i = int(1)

while i < sum:
    number = sum - i
    comp = number * i
    if comp == composition:
        print(f'Вы загадали числа: {i} и {number}')
        break
    i += 1
else:
    print('Не выполнено условие ввода данных.')



